
{
    "about": "حول",
    "portfolio": "معرض الأعمال",
    "flutterDeveloper": "مطور فلاتر",
    "helloMyNameIs": "مرحبا، اسمي\nأسامة رياض",
    "myDescription": "مطور فلاتر مبتدئ ذو حافز عالٍ واهتمام بالتفاصيل، يمتلك أساسًا قويًا في تطوير تطبيقات الهواتف المحمولة. ماهر في تحويل مفاهيم التصميم إلى تطبيقات فعّالة وجذابة بصريًا، ومتحمس لإنشاء حلول مبتكرة وسهلة الاستخدام. متطلع للمساهمة في المشاريع التعاونية، وتنفيذ واجهات المستخدم وتجربة المستخدم، والبقاء على اطلاع بأحدث التقنيات والاتجاهات في الصناعة. ملتزم بتقديم تطبيقات موبايل عالية الجودة ويسعى للحصول على فرص للنمو المهني.",
    "downloadCV": "تحميل السيرة الذاتية",
    "hireMe": "قم بتوظيفي",
    "skills": "المهارات",
    "viewProject": "عرض المشروع",
    "download app": "تحميل التطبيق",
    "BooklyDescription": "تم تطوير 'Bookly'، وهو تطبيق يعرض الكتب الأكثر مبيعًا ويوفر للمستخدمين منصة لتلخيص كتبهم.\n• تم دمج ميزات مثل تلخيص الكتب، التلخيصات التي ينشئها المستخدمون، والإعجاب بالتلخيصات، مما يعزز تفاعل المستخدمين.\n• تم تحسين تجربة المستخدم من خلال البحث عن الكتب، عرض الكتب الشائعة، وإدارة التلخيصات الشخصية، مما يساهم في بناء مجتمع قرّاء تفاعلي وسلس.",
    "ArdDescription": "• تم تصميم وتطوير Ard، وهو منصة زراعية ذكية تعتمد على بيانات ناسا وتحليل الذكاء الاصطناعي لاكتشاف الأراضي الزراعية والمحاصيل بدقة.\n• تم تنفيذ نظام متقدم لاكتشاف الإطارات، مما يساعد المزارعين على مراقبة حقولهم، تقييم صحة المحاصيل، وتحسين الإنتاجية بفعالية.\n• تم دمج مساعد ذكاء اصطناعي يوفر للمزارعين تحليلات لحظية، توقعات الطقس، وتوصيات زراعية بناءً على البيانات الفضائية.\n• تم تحسين تجربة المستخدم من خلال خرائط تفاعلية، تصور البيانات، وواجهة سهلة الاستخدام للوصول إلى المعلومات الزراعية بسهولة.",
    "MealRecommendationDescription": "تم تطوير Meal_Recommendation AI، وهو تطبيق ذكي يستخدم الذكاء الاصطناعي لإنشاء وصفات وجبات مخصصة واقتراحات طعام.\n• تم دمج خيارات البحث والتصفية المتقدمة، مما يمكّن المستخدمين من العثور على وجبات تناسب تفضيلاتهم الغذائية والمكونات المتاحة والقيم الغذائية.\n• تم تحسين تجربة المستخدم من خلال توصيات ديناميكية تعتمد على الذكاء الاصطناعي، لمساعدة المستخدمين على اكتشاف وجبات صحية وجديدة بسهولة.\n• تم التركيز على واجهة سهلة الاستخدام وسريعة الاستجابة، لضمان تجربة تصفح سلسة وممتعة للجميع.",
    "Ulmo": "• تم تطوير Ulmo، وهو تطبيق تجارة إلكترونية متعدد المنصات باستخدام Flutter، يركز على احتياجات المنزل مثل الأثاث، ويوفر تجربة تسوق شبيهة بمتاجر IKEA.\n• تم دمج Firebase كخلفية للتطبيق لإدارة البيانات في الوقت الحقيقي، بما يشمل المنتجات، حسابات المستخدمين، وتتبع الطلبات.\n• تصميم وتنفيذ واجهة مستخدم عصرية وسلسة باستخدام نظام تصميم مبني على Figma، يحتوي على أكثر من 50 شاشة تغطي كافة خطوات التسوق.\n• تطوير لوحة تحكم إدارية عبر الويب باستخدام Firebase وVercel لإدارة المنتجات، معالجة الطلبات، والتحكم بالمستخدمين.\n• توفير ميزات مثل البحث عن المنتجات، التصفية حسب الفئات، إدارة السلة، والدفع الآمن لتجربة مستخدم متكاملة.\n• تم التركيز على الأداء، قابلية التوسع، وبنية نظيفة لضمان تجربة سلسة على أنظمة Android، iOS، الويب، وسطح المكتب.",
    "WeatherAiDescription": " تم تطوير WeatherAi، وهو تطبيق تنبؤ بالطقس مصمم خصيصًا للرياضيين، حيث يوفر توقعات دقيقة ومباشرة بناءً على موقع المستخدم.\n• تم دمج ميزات مثل توقعات الطقس الأسبوعية، الإعدادات القابلة للتخصيص، والتقارير التفصيلية، لمساعدة الرياضيين في التخطيط لأنشطتهم بكفاءة.\n• تم تحسين تجربة المستخدم من خلال واجهة سهلة الاستخدام، تتيح الوصول السريع إلى تحديثات الطقس وإعدادات مخصصة لكل مستخدم.",
    "JustGpaDescription": " تم تطوير JUST GPA، وهو تطبيق مخصص لطلاب جامعة العلوم والتكنولوجيا الأردنية (JUST) لحساب المعدل الفصلي والتراكمي بسهولة ودقة.\n• تم دمج حقول إدخال سهلة الاستخدام وحسابات معدل فورية، لضمان دقة النتائج وتسهيل إدارة الأداء الأكاديمي للطلاب."


}